The ordinate dimension text orientation.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
  Since:  2017 Subscription Update
 Syntax
  C#
public enum OrdinateTextOrientation
  Visual Basic
Public Enumeration OrdinateTextOrientation
  Visual C++
public enum class OrdinateTextOrientation
 Members
  Member name  |   Description
   ParallelToDimensionLine   |   the dimension text orientation parallel to dimension line
   ParallelToWitnessLine   |   the dimension text orientation parallel to witness line
 See Also
  Autodesk.Revit.DB Namespace